   # Load the datframe

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("./data_small/TG_STAID000001.txt",skiprows=20,parse_dates=["    DATE"])

In [4]:
df

       STAID   SOUID       DATE     TG   Q_TG
0          1   35381 1860-01-01     21      0
1          1   35381 1860-01-02     46      0
2          1   35381 1860-01-03     31      0
3          1   35381 1860-01-04     37      0
4          1   35381 1860-01-05     31      0
...      ...     ...        ...    ...    ...
59316      1   35381 2022-05-27  -9999      9
59317      1   35381 2022-05-28  -9999      9
59318      1   35381 2022-05-29  -9999      9
59319      1   35381 2022-05-30  -9999      9
59320      1   35381 2022-05-31  -9999      9

[59321 rows x 5 columns]

# show certain commands

In [6]:
df['   TG']

0          21
1          46
2          31
3          37
4          31
         ...
59316   -9999
59317   -9999
59318   -9999
59319   -9999
59320   -9999
Name:    TG, Length: 59321, dtype: int64

In [7]:
df[['   TG']]

          TG
0         21
1         46
2         31
3         37
4         31
...      ...
59316  -9999
59317  -9999
59318  -9999
59319  -9999
59320  -9999

[59321 rows x 1 columns]

In [9]:
df[['    DATE','   TG']]

            DATE     TG
0     1860-01-01     21
1     1860-01-02     46
2     1860-01-03     31
3     1860-01-04     37
4     1860-01-05     31
...          ...    ...
59316 2022-05-27  -9999
59317 2022-05-28  -9999
59318 2022-05-29  -9999
59319 2022-05-30  -9999
59320 2022-05-31  -9999

[59321 rows x 2 columns]

# simple statistics

In [12]:
# -9999 - means no data 
#place condition inside df.loc["condition"]
# find condition where df column is not equal to -9999
df.loc[df['   TG']!=-9999]

       STAID   SOUID       DATE     TG   Q_TG
0          1   35381 1860-01-01     21      0
1          1   35381 1860-01-02     46      0
2          1   35381 1860-01-03     31      0
3          1   35381 1860-01-04     37      0
4          1   35381 1860-01-05     31      0
...      ...     ...        ...    ...    ...
53655      1   35381 2006-11-26     80      0
53656      1   35381 2006-11-27     70      0
53657      1   35381 2006-11-28     71      0
53658      1   35381 2006-11-29     63      0
53659      1   35381 2006-11-30     84      0

[53103 rows x 5 columns]

In [13]:
# get mean for all values
df.loc[df['   TG']!=-9999].mean()/10

C:\Users\user\AppData\Local\Temp\ipykernel_18620\3941093953.py:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  df.loc[df['   TG']!=-9999].mean()/10

STAID        0.100000
 SOUID    3538.100994
   TG        6.360788
 Q_TG        0.000006
dtype: float64

In [17]:
# since the decimal data will take more space it is stored multiplied by 10
# so 21 is actually 2.1 - to get this original float data we divide by 10
# get only TG column
df.loc[df['   TG']!=-9999]['   TG'].mean()/10

6.360787526128467

In [16]:
# max daily average
df.loc[df['   TG']!=-9999]['   TG'].max()/10

26.2

In [18]:
# min daily average
df.loc[df['   TG']!=-9999]['   TG'].min()/10

-28.8